_org/_posts/2018-10-11-leetcode_6.org
#+BEGIN_HTML
---
layout: post
title: LeetCode 6 Z字形变换
excerpt: 
keywords: ""
categories: 
tags: []
---
#+END_HTML

* LeetCode 6 Z字形变换

** 题目分析
   计算一下对应字符的位置即可，注意numRows为1的边界情况。

** Java代码
#+BEGIN_SRC java
class Solution {
    public String convert(String s, int numRows) {
        if(numRows == 1) return s;
        
        char[] result = new char[s.length()];
        int tail = 0;
        for(int begin=0; begin<numRows; begin++) {
            if(begin >= s.length()) break;
            if(begin == 0 || begin == numRows-1) {
                for(int i=begin; i<s.length(); i+=2*(numRows-1))
                    result[tail++] = s.charAt(i);
            } else {
                for(int i=begin; i<s.length(); i+=2*(numRows-1)) {
                    result[tail++] = s.charAt(i);
                    int j = i + 2*(numRows-1-begin);
                    if(j >= s.length())
                        break;
                    else
                        result[tail++] = s.charAt(j);
                }
            }
        }
        String realResult = new String(result);
        return realResult;
    }
}
#+END_SRC



#+BEGIN_HTML
<!-- more-forword -->
#+END_HTML


#+BEGIN_HTML
<!-- more -->
#+END_HTML
